电脑/python/网络抓取/js相关内容抓取问题.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-01-07 四 16:56 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>js相关内容抓取问题</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">js相关内容抓取问题</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 到底该不该管js代码</a></li>
<li><a href="#orgheadline5">2. selenium模块</a>
<ul>
<li><a href="#orgheadline2">2.1. 安装</a></li>
<li><a href="#orgheadline3">2.2. 一个简单例子</a></li>
<li><a href="#orgheadline4">2.3. 选中某个标签元素</a></li>
</ul>
</li>
<li><a href="#orgheadline6">3. 后台虚拟窗口运行</a></li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">到底该不该管js代码</h2>
<div class="outline-text-2" id="text-1">
<p>
把这个问题先提出来就是要提醒读者，只有确定你要抓取的内容很重要而且必须把js展开内容才能获取，那么才考虑展开js代码。这倒不是实现上有多困难，而是成本太昂贵了。如下面所述及的，我们需要建立一种虚拟后台显示窗口，然后在这个窗口内运行如FireFox这样的浏览器。读者可以看到这种展开工作成本是极其昂贵的。所以如果你的程序一旦决定具体展开js代码了，那么你要清楚决定你程序性能的短板就在这里了，很多常规的程序优化技术和手段可能反倒是杯水车薪了，而围绕着这个具体展开，尽量减少具体的展开工作量，就成了程序性能优化的关键了。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline5">selenium模块</h2>
<div class="outline-text-2" id="text-2">
<p>
selenium模块的官方文档在 <a href="http://selenium-python.readthedocs.org/index.html">这里</a> 。下面就模块的最核心内容做出一些说明。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline2">安装</h3>
<div class="outline-text-3" id="text-2-1">
<pre>
sudo pip3 install selenium
</pre>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline3">一个简单例子</h3>
<div class="outline-text-3" id="text-2-2">
<div class="highlight"><pre><span class="kn">from</span> <span class="nn">selenium</span> <span class="kn">import</span> <span class="n">webdriver</span>

<span class="n">browser</span> <span class="o">=</span> <span class="n">webdriver</span><span class="o">.</span><span class="n">Firefox</span><span class="p">()</span>
<span class="n">browser</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="s">&#39;http://www.163.com&#39;</span><span class="p">)</span>

<span class="n">html</span> <span class="o">=</span> <span class="n">browser</span><span class="o">.</span><span class="n">page_source</span>
<span class="k">print</span><span class="p">(</span><span class="n">html</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">browser</span><span class="o">.</span><span class="n">title</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">browser</span><span class="o">.</span><span class="n">current_url</span><span class="p">)</span>
<span class="n">browser</span><span class="o">.</span><span class="n">quit</span><span class="p">()</span>
</pre></div>

<p>
这里调用的是火狐后台 <code>webdriver.Firefox</code> ，你还可以调用其他后台，这里略过讨论了。
</p>

<p>
通过browser的 <code>get</code> 方法来在模拟浏览器中输入一个网址，然后通过 <code>page_source</code> 方法来获取目标网址源码， browser还有属性 <code>title</code> 当前网页标题； <code>current_url</code> 当前网址。然后通过 <code>quit</code> 方法关闭该浏览器。
</p>

<p>
一般情况下获取目标网页的html解析之后的源码就可以了，通过其他工具如beautifulsoup等来进一步提取信息。selenium的browser还有很多方法来获取标签对象，某一两个信息提取任务的时候可以用一下，其主要是用于选中某个标签元素，然后进行额外的模拟人手工的如点击输入文本等动作的。
</p>
</div>
</div>




<div class="outline-3">
<h3 id="orgheadline4">选中某个标签元素</h3>
<div class="outline-text-3" id="text-2-3">
<p>
前面提及的browser对象有很多选中某个或某些标签元素的方法:
</p>
<ul class="org-ul">
<li>find_element_by_id</li>
<li>find_element_by_name</li>
<li>find_element_by_xpath</li>
<li>find_element_by_link_text</li>
<li>find_element_by_partial_link_text</li>
<li>find_element_by_tag_name</li>
<li>find_element_by_class_name</li>
<li>find_element_by_css_selector</li>
</ul>

<p>
然后这些方法若element改为elements则会选中多个标签元素，如: <code>find_elements_by_id</code> 。
</p>

<p>
具体请参看官方文档，这里就不一一说明了。 <a href="https://saucelabs.com/resources/selenium/css-selectors">这篇网页</a> 介绍了Xpath和css选定的一些细节，介绍的很好。
</p>

<p>
这些函数返回的是标签元素对象e，你可以通过 <code>e.get_attribute('src')</code> 来获取该标签的某个属性的值。然后还有其他一些方法，这里先略过讨论了。正如前所述及的，selenium的重点是模拟浏览器的各个动作，而不是要做类似beautifulsoup这样的api工作。所以其提供了 <code>e.click()</code> 就模拟了鼠标点击在该标签元素上的行为；还有 <code>e.send_keys(Keys.RETURN)</code> 就模拟了在该标签元素上按下回车键的行为。等等这些才是selenium的关注重点，更多相关细节请参看官方文档的相关 Action Chains 部分。
</p>
</div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline6">后台虚拟窗口运行</h2>
<div class="outline-text-2" id="text-3">
<p>
经过测试行为一切OK了，你就不希望再看到弹出的浏览器窗口了，你可以通过一种虚拟显示技术来做到。首先安装 <code>xvfb</code>:
</p>
<pre>
sudo apt-get install xvfb
</pre>

<p>
然后安装 <code>pyvirtualdisplay</code> 模块:
</p>

<pre>
sudo pip3 install pyvirtualdisplay
</pre>

<p>
这里参考了 <a href="http://coreygoldberg.blogspot.com/2011/06/python-headless-selenium-webdriver.html">这篇网页</a> 。大体例子如其所示:
</p>
<pre>
def wget_forcejs(url):
    from pyvirtualdisplay import Display
    from selenium import webdriver

    display = Display(visible=0, size=(800, 600))
    display.start()

    # now Firefox will run in a virtual display.
    # you will not see the browser.
    browser = webdriver.Firefox()
    browser.get(url)

    html = browser.page_source
    print(browser.title)

    browser.quit()
    display.stop()
    return html
</pre>
</div>
</div>
</div>
</body>
</html>
